const createMockArticle = (title: string, date: string, author: string, category: string, excerpt?: string, image?: string) => ({
	title,
	excerpt,
	image,
	date,
	author,
	category,
});

export const mockArticles = [
	createMockArticle(
		'ดาวเคราะห์น้อยริวงุอาจไม่ใช่ดาวเคราะห์น้อย แต่เป็นซากดาวหาง',
		'2022-02-02',
		'วิมุติ วสะหลาย',
		'ข่าว',
		'เมื่อปี 2557 ยานฮะยะบุซะ 2 ขององค์การอวกาศญี่ปุ่นหรือแจ็กซา ได้ออกเดินทางจากโลกไปโดยมีเป้าหมายคือดาวเคราะห์น้อยริวงุ ยานได้ไปถึงเป้าหมายในเดือนมิถุนายน 2561 และได้ศึกษาดาวเคราะห์น้อยดวงนี้อย่างใกล้ชิดเป็นเวลา'
	),
	createMockArticle(
		'ดาวอังคารแดนเงียบสงัด',
		'2022-03-11',
		'วรเชษฐ์ บุญปลอด',
		'ข่าว',
		'บนดาวอังคารมีเหตุการณ์ต่าง ๆ ที่ทำให้เกิดเสียงมากมาย เช่น พายุที่รุนแรง ฟ้าแลบฟ้าร้อง แต่กระนั้นดาวเคราะห์ดวงนี้ก็เป็นดินแดนที่เงียบอย่างเหลือเชื่อ เมื่อเดือนกุมภาพันธ์ 2564 ยานเพอร์เซอร์วีรันซ์ขององค์การนาซาได้เดินทางไปถึงดาวอังคาร ยานพร้อมทั้งอุปกรณ์'
	),
	createMockArticle(
		'อภิมหาดาวหาง ใหญ่มหึมา',
		'2022-01-24',
		'ธรรมฤทธิ์ ลิขิตธีรเมธ',
		'ข่าว',
		'เมื่อปลายปีที่แล้ว มีรายงานการค้นพบดาวหางดวงใหม่ดวงหนึ่งที่มีขนาดใหญ่มากและกำลังมุ่งหน้าเข้ามายังระบบสุริยะชั้นใน ดาวหางดวงนี้มีชื่อว่า ซี/2014 ยูเอ็น 271 (เบอร์นาร์ดิเนลลี-เบิร์นสไตน์) [C/2014 UN271 (Bernardinelli-Bernstein)] ต่อมาเมื่อเดือนมกราคมปีนี้ คณะนักดาราศาสตร์นำโดย ดร.สวี่ เหวินเทา จากมหาวิทยาลัยเทคโนโลยีและวิทยาศาสตร์มาเก๊า ได้สำรวจดาวหางดวงนี้อีกครั้งด้วยกล้องโทรทรรศน์อวกาศฮับเบิลเพื่อวัดขนาดของนิวเคลียสให้แน่ชัด'
	),
];
